//=============================================================================
//
// Sky管理 [Sky.cpp]
// Author : 柏村大地
//
//=============================================================================
#include"Sky.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************



//=============================================================================
// コンストラクター
//=============================================================================
Sky::Sky()
{
	m_prefab = new Prefab;
	m_prefab->SetModel("model_sky_spring_01.obj");

	XMFLOAT3 pos = { 0.0f, 0.0f, 0.0f };
	XMFLOAT3 rot = { 0.0f, 0.0f, 0.0f };
	XMFLOAT3 scl = { 4.0f, 4.0f, 4.0f };

	SetPos(pos);
	SetRot(rot);
	SetScl(scl);

}

//=============================================================================
// デストラクター
//=============================================================================
Sky::~Sky()
{
	if (m_prefab) { delete m_prefab; }
}

//=============================================================================
// 更新処理
//=============================================================================
void Sky::Update(void)
{

	// ローカル回転
	XMFLOAT3 rot2 = GetRot();
	rot2.y += 0.001f;

	if (rot2.y >= XM_PI * 2) { rot2.y = 0.0f; }

	SetRot(rot2);


}


//=============================================================================
// 描画処理
//=============================================================================
void Sky::Draw(void)
{
	// ラスタライザ設定
	SetCullingMode(CULL_MODE_FRONT);	//表のポリゴンを描画しない

	SetDepthEnable(TRUE);

	// ワールドマトリクス生成
	XMMATRIX mtxWorld = GetWorldMatrix(GetPos(), GetRot(), GetScl());

	// プレハブ(ローカル座標)にワールドマトリクスをかける
	mtxWorld = XMMatrixMultiply(mtxWorld, m_prefab->GetMtxWorld());

	SetWorldMatrix(&mtxWorld);	// シェーダーにデータを送る

	DrawModel(m_prefab->GetModel());

	SetCullingMode(CULL_MODE_BACK);		//カリングを戻す

}
